# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#

Company.create!([
                  {
                    name: 'ФОРА', endpoint: 'https://fora.ua/promotions'
                  },
                  {
                    name: 'ВАРУС', endpoint: 'https://varus.ua/rasprodazha'
                  },
                  {
                    name: 'СІЛЬПО', endpoint: 'https://silpo.ua/offers'
                  },
                  {
                    name: 'АТБ', endpoint: 'https://gotoshop.ua/kiev/shops/atb'
                  }
                ])

# A capital letter means a Latin letter
Category.create!([
                   {
                     name: 'Вода, соки, напої',
                     keywords_by_semicolons: 'мінеральна;сильногазована;негазована;безалкогольний;соковмісний;квас;'\
                                             'живчик;лимонад;сік;напій aquarte;Cік;bon boisson;соком;сидр;Cидр;'\
                                             'coca-cola;нектар;fanta;концентрат лимонний;'\
                                             'сильногазований;біола;buvette;гарячого шоколаду;сироп;кола;ситро;'\
                                             'соковий;напій ecomil;тархун;'
                   },
                   {
                     name: 'Кава, чай',
                     keywords_by_semicolons: 'кава;чай;кавовий;суміш ягідна;суміш фруктово-ягідна;суміш фруктова;кави;'\
                                             'кAвA;'
                   },
                   {
                     name: 'Алкоголь',
                     keywords_by_semicolons: 'пиво;вино;алкогольний;джин;коньяк;слабоалкогольний;слабоалкогол;горілка;'\
                                             'рому;віскі;ром;вермут;настоянка;лікер;вина;бренді;винний;бурбон;текіла;'\
                                             'фраголіно;лIкер;наливка;шампанське;мескаль;пивO;ромовий;'
                   },
                   {
                     name: 'Молочні продукти',
                     keywords_by_semicolons: 'молоко;сир;кефір;сметана;вершки;ряжанка;масло;йогурт;біфідойогурт;'\
                                             'сирний продукт;маргарин;коктейль молочний;закваска;рослинно-вершкова;'\
                                             'кисломолочний;згущений;сиркова;геролакт;молоці;'
                   },
                   {
                     name: 'Солодощі',
                     keywords_by_semicolons: 'цукерки;шоколад;печиво;торт;тістечка;тістечко;батончик;вафлі;морозиво;'\
                                             'цукор;пряники;зефір;бісквіт;десерт;льодяники;маршмелоу;сирок;джем;'\
                                             'варення;шоколадне;солодка;кекс;подушечки yummoji;сирочок;пряник;'\
                                             'шоколадом;вAфлI;шоколадним;мед;шоколаді;шоколадна;халва;вафельні;'\
                                             'козинак;шоколадний;печенье;мармелад;пончик;вафельна;круасани;пахлава;'\
                                             'карамель;шоколаду;'
                   },
                   {
                     name: 'Хлібобулочні вироби',
                     keywords_by_semicolons: 'хліб;тісто;багет;булочка;сушка;сушки;хлібці;соломка;лаваш;батон;галети;'\
                                             'пиріжки;'
                   },
                   {
                     name: 'Риба та морепродукти',
                     keywords_by_semicolons: 'скумбрія;хек;оселедець;лосось;паста креветкова;форель;сьомга;оселедця;'\
                                             'морський коктейль;креветки;форелі;лосося;лососеві;минтай;крабом;сардини;'\
                                             'тунець;шпроти;риби;сайди;сардина;мойви;лососем;мідіі;мідії;креветкова;'\
                                             'креветка;вугор;кілька;корюшка;сардини;крабові;минтая;кальмар;лососева;'\
                                             'тріски;зубатка;мойва;сьомгою;Cардини;'
                   },
                   {
                     name: 'Снеки',
                     keywords_by_semicolons: 'сухарики;чипси;крекер;арахіс;чіпси;попкорн;горіхів;чIпси;снеки;горіхи;'\
                                             "сухарі;кеш'ю;палички кукурудзяні;"
                   },
                   {
                     name: 'Ковбасні вироби',
                     keywords_by_semicolons: 'салямі;сосиски;ковбаса;сардельки;ковбаски;ковбасний;колбаса;'
                   },
                   {
                     name: 'Овочі, гриби, зелень',
                     keywords_by_semicolons: 'кукурудза;огірки;помідор;горошок;суміш овочева;салат;овочі;'\
                                             'ікра кабачкова;капуста;цибуля;гриби;шпинат;огірок;рукола;щавель;томати;'\
                                             'салатів;кабачок;овочева;корнішони;кабачків;квасоля;аджика;петрушка;'\
                                             'кабачки;томат гілка;імбир;'
                   },
                   {
                     name: 'Крупи, макарони, швидке пр.',
                     keywords_by_semicolons: 'вермішель;сніданок;рис;крупа;локшиною;макаронні;пластівці;макарони;'\
                                             'пюре любисток;кранчі;швидкого приготування;тортеллоні;хумус;кульки;'\
                                             'локшина;суміш garde manger;сніданки;пюре;грильяж;пластівців;крем-суп;'\
                                             'злакові подушки;вівсяна;мюслі;'
                   },
                   {
                     name: "М'ясо та напівфабрикати",
                     keywords_by_semicolons: 'фарш;стегна;грудинки;свиняча;стегно;гомілка;биток;паштет;курячі;свинячі;'\
                                             'грудинка;корейка;бекон monells;буженина;балик;окіст;шлунок;хамон;'\
                                             'вареники;нагетси;пельмешки;млинці;серце куряче;крило куряче;свинина;'\
                                             'пельмені;пельмішки;напівфабрикат;пельменI;балику;індички;курка;курица;'\
                                             "шашлик;свинини;котлети;м'ясо;рулька;бендерики;хінкалі;свині;куряче;"\
                                             'пельмени;сало;курочка;щоковина;'
                   },
                   {
                     name: 'Для приготування, соуси',
                     keywords_by_semicolons: 'соус;приправа;олія;прянощі;прянощів;суміш перців;гірчиця;кумін;'\
                                             'перець любисток;прованські;майонез;паприка;желе;духмяний горошком;сіль;'\
                                             "розпушувач;маринад;тим'ян;борошно;закуска;заправка;кислота лимонна;суп;"\
                                             'лечо;лавровий;кетчуп;тарталетки;желатин;салатний;оцет;сода;кисіль;'
                   },
                   {
                     name: 'Для дітей',
                     keywords_by_semicolons: 'підгузники;дітей;д/дітей;дитячий;дитячі;карапуз;дитяча;іграшка;'\
                                             'підгузки-трусики;іграшкових;підгузки;іграшок;'
                   },
                   {
                     name: 'Гігієна',
                     keywords_by_semicolons: 'душа;душу;мило;гоління;шампунь;зубна;антиперспірант-спрей;'\
                                             'антиперспірант;ніжне зволоження;дезодорант-спрей;дезодорант;прокладки;'\
                                             'палички ватні;диски ватні;бархатні ручки;оксамитові ручки;тампони;'\
                                             'станок;ватних паличок;ватні палички;ватні диски;бритви;бритва;'\
                                             'антиперспирант-спрей;'
                   },
                   {
                     name: 'Косметика та догляд',
                     keywords_by_semicolons: 'шкіри;очі;бальзам;маска;обличчя;волосся;тонік;гомаж;нігтів;для рук;'\
                                             'вмивання;крем денний;гель-крем;бальзам-обполіскувач;гель beauty;'\
                                             'для тіла;макіяжу;крем-пінка;гель-скраб;скраб;міцелярна;шкіра;макияжа;'
                   },
                   {
                     name: 'Для дому, побутова хімія',
                     keywords_by_semicolons: 'кухонні;для кухні;крем для чистки;засіб дезінфікуючий;унітаза;'\
                                             'для сміття;губки;серветки;domestos;рушники;фольга;плівка;чищення;миючий;'\
                                             'електрофумігатор;прання;пакети;посудомийних;посудомийної;'\
                                             "пральний порошок;унітазу;миття;серветка;пом'якшувач для тканин;чистячий;"\
                                             'пігулка чистоти;кондиціонер для білизни;плямовивідник;рукавички;'\
                                             'ганчірка;туалету;пральний;ополіскувач;посуду;запікання;випічки;'\
                                             'кухонного;туалетний;очищувач;освіжувач;ополіскування;гель-диски;'\
                                             'прибирання;'
                   },
                   {
                     name: 'Для тварин',
                     keywords_by_semicolons: 'котів;кошенят;собак;'
                   },
                   {
                     name: 'Фрукти та ягоди',
                     keywords_by_semicolons: 'лимон;яблуко;авокадо;апельсин;оливки;вишня;лохина;ананас;фініки;'\
                                             'смородина;манго;ананаси;фiнiк;'
                   },
                   {
                     name: 'Інше',
                     keywords_by_semicolons: 'інше!;'
                   }
                 ])
